Revit 2027 API
LinePattern Properties
The LinePattern type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  Line pattern name.
Top
See Also
Reference
LinePattern Class
Autodesk.Revit.DB Namespace